import { Component } from '@angular/core';

type WholesaleFeatureItem = {
  title: string;
  text: string;
};

type WholesaleFeaturesSectionData = {
  heading: string;
  subheading: string;
  items: WholesaleFeatureItem[];
};

@Component({
  selector: 'lib-company-features-wholesale',
  imports: [],
  templateUrl: './company-features-wholesale.html',
  styleUrl: './company-features-wholesale.css',
})
export class CompanyFeaturesWholesale {
  readonly wholesaleFeaturesSectionData: WholesaleFeaturesSectionData = {
    heading: 'Гуртові постачання від Сlass Kedr',
    subheading:
      'Організація постачань будь-якого обсягу базується на глибокій інтеграції у професійне середовище та партнерстві з виробничими лініями. Це дає можливість забезпечувати гуртові ціни та серійність продукції без залучення зайвих посередників.',
    items: [
      {
        title: 'Організація обсягів під запит',
        text: 'Забезпечується виконання замовлень від дрібної гуртової партії до повної комплектації великих виробників.',
      },
      {
        title: 'Експертний підбір та реновація',
        text: 'Професійна ідентифікація фурнітури та підбір аналогів під існуючі посадкові місця, що критично важливо для виробників дверей.',
      },
      {
        title: 'Гнучке ціноутворення',
        text: 'Формування вигідних умов за рахунок прямих домовленостей та відсутності витрат на утримання масштабних логістичних надбудов.',
      },
      {
        title: 'Офіційний супровід',
        text: 'Робота ведеться через банківські рахунки з наданням повного пакета документів (в тому числі з ПДВ), що гарантує юридичну чистоту кожної угоди.',
      },
      {
        title: 'Пряма координація',
        text: 'Персональна залученість сторони, що реалізує товар, дозволяє оперативно керувати відвантаженнями та гарантувати стабільну якість кожної партії.',
      },
      {
        title: 'Складська готовність і резерв',
        text: 'Підтримується оперативний запас ходових позицій та попереднє резервування номенклатури під виробничі графіки партнерів.',
      },
    ],
  };
}
